

# TODO
# Пользователь вводит 3 числа, найти среднее арифмитическое с точность 3

first_number = float(input("Введите первое число!: "))
second_number = float(input("Введите второе число!: "))
third_number = float(input("Введите третье число!: "))

result = (a+b+c / 3)
print(round(result, 3))