

# TODO Без использования collections, написать программу, которая будет создавать словарь
#  для подсчитывания количества вхождений каждой буквы в текст введенный с клавиатуры


text = input("Введите текст!: ")
counter = list(text)


print(text_2)

# Код анализа.
#
# text = 'hello world'
# unique_letters = set(text)
# analize = {}
# for letter in unique_letters:
#     analize[letter] = text.count(letter)
#
# print(counter)